; Language definition file for IconPackager. 
;
; .\Program Files\Stardock\Object Desktop\IconPackager\Lang\Default.lng (Default language - English)
; .\Program Files\Stardock\Object Desktop\IconPackager\Lang\English.lng (Add other .lng files for additional languages)
;
; This is a UniCode text file that will appear as gibberish if opened in an editor that does not support it. 
; The Notepad.exe included with Windows 2000 or later will support editing this file. 
;
;

[Strings]
1=IconPackager
2="%s icon package has been successfully installed."
3="Packages"
4="Icons and Cursors"
5="Settings"
6="Icon Explorer"
7="Help"
8="OK"
9="Cancel"
10="Apply"
11="IconPackager will now restore all your icons to the Windows defaults.\n\nAre you sure you want to continue?"
12="IconPackager will now restore all your cursors to the Windows defaults.\n\nAre you sure you want to continue?"
13="If you are having problems with the wrong icon image being displayed for an application, icon, or cursor, etc, then IconPackager can detect these problems and fix them for you.\n\nWould you like IconPackager to fix them now?"
14="Open Package"
15="Package Files (*.iconpackage, *.iptheme, *.ip, *.theme)|*.iconpackage;*.iptheme;*.ip;*.zip;*.theme|Icon Packages (*.iconpackage, *.iptheme)|*.iconpackage;*.iptheme|Microsoft Theme (*.theme)|*.theme|Zipped Package (*.ip)|*.ip;*.zip||"
16="&Register IconPackager"
17=" (Evaluation Day: %d of 30)"
18="Would you like to save your changes before closing?"
19="Do you want to save your icon package before closing?"
20="IconPackager requires IconDeveloper installed on your computer to perform the operation. Do you want to download and install it now?"
21=" (not in shareware)"
22="http://www.iconzone.com"
23="support@stardock.com"
24="news://news.stardock.com/stardock.iconpackager"
25="http://www.wincustomize.com/Skins.aspx?LibID=2&a=ip"
26="You must enter a valid author to continue."
27="You must enter a valid email to continue."
28="You must enter a valid website to continue."
29="You must enter a valid comment to continue."

;
;Available Packages
;
30="Windows Default Icons"
31="Author : Microsoft"
32="Author : %s"
33="Author : Unknown"
34="Featured Package"
35=" by "
36="   ... Visit WinCustomize.com for additional packages!"
37="Selected Package: %s"
38="&Load"
39="&Preview"
40="Install &new Package"
41="&Delete"
42="Info..."
43="Recolor Package using IconDeveloper"
44="&Search..."
45="Sort by name"
46="Sort by author"
47="Sort by date"
48="Sort by WinXP or above"
49="Sort by icon count"
50="Sort by Search Results"
51="Desktop"
52="Start"
53="Folders"
54="Drives"
55="Others"
56="Files"
57="Custom Files"
58="Cursors"
59="Quick Launch"
60="Not a valid package file "%s"."
61="You must select a valid icon package to continue."
62="There was an error updating the selected package information."
63="Install Package"
64="Icon Packages (*.ip, *.iconpackage, *.iptheme, *.theme)|*.ip;*.zip;*.iconpackage;*.iptheme;*.theme|All Files|*.*||"
65="You cannot delete the selected package as it is currently in use."
66="Are you sure want to delete the '%s' icon package?"
67="There was an error deleting the selected package, please try again."
68="You must select a valid icon package to continue."
69="Zip Icon Package"
70="Icon Package (*.ip)|*.ip||"
71="Include"
72="Control Panel"
73=""
74=""
75=""
76=""
77=""
78=""
79=""

;
;Featured Package
;
80="Featured Package"
81="&Get More Packages!"
82="&Download"
83="Cancel"
84="Contacting WinCustomize.com..."
85=" by "
86="Click to view large preview"
87=""
88=""
89=""

;
;Search Packages
;
90="Search Packages"
91="Enter a search name or author below to find a required icon package."
92="&Search:"
93="OK"
94="Cancel"
95="You must enter a search string to continue."
96=""
97=""
98=""
99=""

;
;Package Info
;
100="Package Info"
101="&Author:"
102="&E-mail:"
103="&Web site:"
104="&Comments:"
105="Windows &XP or above package"
106="OK"
107="Cancel"
108="Go"
109=""

;
;Package Preview
;
110="Preview"
111="All Icons"
112="General Preview"
113="Desktop Icons"
114="Start Icons"
115="Folder Icons"
116="Drive Icons"
117="Other Icons"
118="File Icons"
119="Cursors"
120="Quick Launch"
121="View Icon"
122="Export Image"
123="Copy Image"
124="Edit using IconDeveloper"
125="Windows View"
126="Custom View"
127="%d Formats"
128="%d Icons"
129="%d Images"
130="Export Image"
131="Bitmap (*.bmp)|*.bmp||"
132="Control Panel"
133=""
134=""
135=""
136=""
137=""
138=""
139=""

;
;Icons and Cursors
;
140="Desktop"
141="Start"
142="Folders"
143="Drives"
144="Others"
145="Files"
146="Cursors"
147="Launch"
148="Desktop Icons"
149="Start Menu Icons"
150="Folder Icons"
151="Drive Icons"
152="Other Icons"
153="File Type Icons"
154="Cursors"
155="Quick Launch Icons"
156="The icons for the Windows XP Classic Start Menu cannot be changed.\n\nThis is currently a limitation within the operating system, and not a problem with the IconPackager application."
157="No icons found in "%s"."
158="Invalid cursor file."
159="Switching drive modes will lose any changes to drive icons you have made.\n\nAre you sure you want to continue?"
160="Change Cursor for %s"
161="Cursor Files (*.cur, *.ani)|*.cur;*.ani|Standard Cursors (*.cur)|*.cur|Animated Cursors (*.ani)|*.ani||"
162="Could not load common.dll file."
163="IconPackager has detected that your current settings restrict some of the icons in this package from being applied.\n\nWould you like to apply all the icons in this icon package?"
164="This icon package is designed for Windows XP or above and may not display correctly on your computer.\n\nAre you sure you want to load this icon package?"
165="You currently have your drive icons set to Individual Drive Mode.\n\nWould you like to disable this feature while loading the selected icon package?"
166="Are you sure you want to overwrite the '%s' icon package?"
167="Save Icon Package"
168="Icon Package|*.iconpackage||"
169="You must first change an icon before you can save your package."
170="There was an error saving the selected package, please try again."
171="File Name: %s"
172="&Change Icon..."
173="&Restore Default"
174="&Edit Icon..."
175="&Edit Cursor..."
176="&Add Format..."
177="Re&move Format"
178="Individual &Drive Mode"
179="File Name: %s,%d"
180="Windows Default Icon"
181="File Name: %s"
182="Windows Default Cursor"
183="Missing or invalid graphic configured for this icon"
184="Failed to update shortcut file '%s.lnk'.\n\nMake sure the shortcut file is not currupt and is not set to read-only."
185="IconPackager has notified Windows of your changes.\n\nWindows contains flaws that can cause these changes to be ignored under certain conditions. If your changes are not applied you will need to select the "Rebuild Icon Cache" option from the Tools menu.\n\nFor more information about this problem, please refer to the IconPackager help."
186="IconPackager has detected that Windows Explorer is configured to run as a separate process.\n\nWhen using this setting, some icons will not be shown correctly and Windows will revert to displaying the default Windows icons.\n\nWould you like to disable separate Explorer processes so that all icons are shown correctly?"
187="The launch folder windows in a separate process setting has been disabled.\n\nYou will need to close and reopen any folder windows for the changes to take affect."
188="IconPackager has detected you are using ObjectZip with the zip icon badge overlay enabled. This feature can hide the zip icon from displaying the full image.\n\nWould you like to hide the badge icon so that zip icons are shown correctly?"
189=""
190="Export Image"
191="Bitmap (*.bmp)|*.bmp||"
192="Control Panel"
193="Control Panel Icons"
194=""
195=""
196=""
197=""
198=""
199=""

;
;Add File Format
;
200="Add File Format"
201="Select from the available file type extensions below to add it to IconPackager."
202="Registered file &types:"
203="Extension"
204="File Type"
205="%s File"
206="&New..."
207="&Add"
208="Cancel"
209="Extension %s is already associated with an existing extension. Please try a different extension."
210="You cannot change the icon for this file type. Please select another and try again."
211="File extension already exists, please select another."
212=""
213=""
214=""

;
;Create New Extension
;
215="Create New Extension"
216="&File Extension:"
217="&Description:"
218="You must enter a file extension to continue."
219="You must enter a description to continue."
220=""
221=""
222=""
223=""
224=""

;
;Apply Theme
;
225="Apply Theme"
226="Select the settings below that you want to apply for the %s Theme."
227="Desktop Wallpaper"
228="Desktop Icons"
229="Screen Saver"
230="Mouse Pointers"
231="Font Names and Styles"
232="Font and Window Sizes"
233="Window Colors"
234="Sound Events"
235="OK"
236="Cancel"
237=""
238=""
239=""

;
;Settings
;
240="Windows Settings"
241="Show icons using all possible colors"
242="Display shortcut overlay icons"
243="Show icon files as icon image"
244="Show cursor files as cursor image"
245="Use large icons"
246="Icon size:"
247="pixels"
248="Advanced"
249="Icon cache size:"
250="KB"
251="Opening Icon Packages"
252="Restore all icons before opening a new package"
253="Restore all cursors before opening a new package"
254="Show preview window on opening a package"
255="Use smart package loading"
256="Only load File Icons for registered file types"
257="Apply random package on Windows startup"
258="Apply package icons to Internet Explorer Favorites"
259="Show splash screen when applying packages"
260="Saving Icon Packages"
261="Show Package Info dialog on saving a package"
262="Save package as individual icons"
263="Remove duplicate icons from my package to save space"
264="Display"
265="Save IconPackager settings between sessions"
266="Show 'Icon' tab in File/Folder/Drive Properties dialog"
267="Show 'Icon' tab in File and Drive Properties dialog"
268="Display small icon previews"
269="Show Microsoft Plus! Themes within packages list"
270="Packages Directory"
271="Restore &Defaults"
272="Rebuild Icon &Cache"
273="&Repair Icon Images"
274="&Internet Settings..."
275="Packages Directory"
276="&Path:"
277="&Browse..."
278="Select a Packages directory below:"
279="Are you sure you want to restore all settings to system defaults?"
280=""
281=""
282=""
283=""
284=""

;
;Select Language
;
285="Select Language"
286="Select below from the available languages the application can use."
287="OK"
288="Cancel"
289=""

;
;About IconPackager
;
290="About IconPackager"
291="Version: %s"
292="Lead Developer: %s"
293="Registered Copy."
294="Internet:"
295="A component of ObjectDesktop.net"
296="&Order IconPackager"
297="OK"
298=""
299=""

;
;Random Package
;
300="Random Package"
301="You can select below individual packages to include when applying a random package."
302="&Available packages:"
303="&Random packages:"
304="&Add >>"
305="<< &Remove"
306="&Use all available packages"
307="&Apply random package on Windows startup"
308="OK"
309="Cancel"
310="You must have a minimum of two package set for random packages to work."
311=""
312=""
313=""
314=""

;
;Change Icon
;
315="Change Icon"
316="Change Icon for %s"
317=&Look for icons in this file:
318=&Browse...
319=&Select an icon from the list below:
320=&Restore Default
321=OK
322=Cancel
323="Icon Files|*.ico;*.exe;*.dll;*.icl;*.ocx;*.cpl|Programs (*.exe)|*.exe|Libraries (*.dll, *.ocx, *.icl, *.cpl)|*.dll;*.ocx;*.icl;*.cpl|Icons (*.ico)|*.ico|All Files (*.*)|*.*||"
324="File not found "%s"."
325="No icon found in "%s"."
326="IconPackager requires IconDeveloper installed on your computer to perform the operation. Do you want to downoad and install it now?"
327="&Select"
328="&Edit using IconDeveloper..."
329="S&mall Icons"
330="&Large Icons"
331="Restore &Windows default"
332="Restore &current icon"
333="Search for %s images from other Themes"
334="Selected Items"

;
;Package Builder
;
335="Package Builder"
336=" New"
337=" Open"
338=" Save"
339="Desktop Icons"
340="Start Icons"
341="Folder Icons"
342="Drive Icons"
343="Other Icons"
344="File Icons"
345="Cursors"
346="New"
347="Open"
348="Save"
349="Save As"
350="Show in Groups"
351="Sort By"
352="Windows View"
353="Custom View"
354="Would you like to save your changes first?"
355="Open Package"
356="Package Files (*.iconpackage, *.iptheme, *.ip, *.theme)|*.iconpackage;*.iptheme;*.ip;*.zip;*.theme|Icon Packages (*.iconpackage, *.iptheme)|*.iconpackage;*.iptheme|Microsoft Theme (*.theme)|*.theme|Zipped Package (*.ip)|*.ip;*.zip||"
357="Save Icon Package"
358="Icon Package|*.iconpackage||"
359="There was an error saving the selected package, please try again."
360="Custom Files"
361="Quick Launch Icons"
362="Control Panel Icons"
363=" Recent"
364="Recent Themes"
365=" Sub Packages"
366="Sub Packages"
367=" Groups"
368=""
369=""
370=""
371=""
372=""
373=""
374=""

;
;Sub Packages
;
390="Sub Packages"
391="You can configure sub packages below for your current theme. Sub packages are displayed within a dropdown list when a user selects the package."
392="Name"
393="File"
394="Load Parent"
395="&Add New..."
396="&Edit..."
397="Move &Up"
398="Move &Down"
399="OK"
400="Cancel"
401=""
402=""
403=""
404=""
405=""

;
;Edit Sub Package
;
410="Edit Sub Package"
411="Select below to configure a sub package."
412="&Name:"
413="File &name:"
414="&Load parent package"
415="&Browse..."
416="OK"
417="Cancel"
418="You must enter a valid sub theme name to continue."
419="You must enter a valid sub theme file to continue."
420="There was an error with the selected package, please try again."
421=""
422=""
423=""
424=""

;
;IconPackager Menu
;
495="&File"
496="&View"
497="&Tools"
498="&Help"
499=""
500="&Open Package...\tCtrl+O"
501="&Save Package\tCtrl+S"
502="Save Package &As...\tCtrl+A"
503="&Zip Package...\tCtrl+Z"
504="&Language..."
505="&Exit"
506="&Local Update"
507="&Package Builder"
508="&Featured Package..."
509="Restore all &Icons"
510="Restore all &Cursors"
511="Run Icon&Developer..."
512="&Recolor Package..."
513="&Plugins..."
514="R&andom Package..."
515="Add File &Format..."
516="Re&build Icon Cache"
517="Repair Icon I&mages"
518="Repair &Shell Icons"
519="&Contents and Index\tF1"
520="&History"
521="On The &Web"
522="IconPackager &Web Site"
523="IconPackager &Email"
524="IconPackager &Forum"
525="&Download Additional Packages!"
526="&About IconPackager"
527="&New Package...\tCtrl+N"
528="No Recent Packages"
529="&Register IconPackager"

;
;Package File Menu
;
530="&Load"
531="Previe&w...\tCtrl+P"
532="Package &Info...\tCtrl+I"
533="&Search...\tCtrl+R"
534="Re&color Package...\tCtrl+C"
535="&Zip Package...\tCtrl+Z"
536="&Delete\tDel"
537="&Install Package"
538="Install from &disk..."
539="Install from the &web..."
540="&Refresh\tF5"
541=""
542=""
543=""
544=""

;
;Icon Menu
;
545="C&hange Icon..."
546="Restore &Windows Default"
547="Restore C&urrent Icon"
548="&Export Image..."
549="&Copy Image"
550="Edit using Icon&Developer..."
551="&View Icon..."
552="&Add Format..."
553="R&emove Format"
554="&Properties..."

;
;Preview Menu
;
555="&View Icon"
556="&Export Image..."
557="&Copy Image"
558="Edit using Icon&Developer..."
559="&Properties"
560=""
561=""
562=""
563=""
564=""

;
;Restore Icon Menu
;
565="Restore &Windows default"
566="Restore &current icon"
567="Restore all %s icons"
568="Restore &current cursor"
569="Restore all Cursors"
570=""
571=""
572=""
573=""
574=""

;
;Package Builder Menu
;
575="&Change Icon"
576="&Set Default Icon"
577="&Export Image..."
578="C&opy Image"
579="Edit using Icon&Developer..."
580="&View Icon"
581="&Properties"
582="&Add Format..."
583="Re&move Format"
584=""

;
;Package Builder Sort Menu
;
585="&Default"
586="&Name"
587="&Set Icons"
588=""
589=""

;
;About Links
;
590="support@stardock.com"
591="http://www.iconzone.com"
592="news://news.stardock.com/stardock.iconpackager"
593="Click to email: support@stardock.com"
594="Click to view the IconPackager Web Site"
595="Click to view the IconPackager forums"
596=""
597=""
598=""
599=""

;
;Icon Menu Sorting
;
600="&Sort"
601="by Default"
602="by Application"
603="by Extension"
604=""
605=""
606=""
607=""
608=""
609=""

;
;Repair Shell Icons
;
610="Repair Shell Icons"
611="IconPackager can repair your shell icons for processes that do not display the correct customized icons."
612="&Do not repair any shell icons on my computer"
613="Repair shell icons for &all processes"
614="Repair &shell icons for the following processes only"
615="&Add..."
616="&Remove"
617="Reset &List"
618="OK"
619="Cancel"
620="Are you sure you want to remove all processes?"
621="Processes (*.exe)|*.exe|All Files|*.*||"
622="Add Process"
623=""
624=""
625=""
626=""
627=""
628=""
629=""

;
;Explorer Shell Extension (Property Page)
;
1000="Icon"
1001="You can customize the appearance of this file, folder, or drive by changing its properties below."
1002="Current &icon:"
1003="Change the icon for this file only"
1004="Drag and drop icons here, or use the Change Icon button opposite."
1005="&Change Icon..."
1006="&Description:"
1007="&Settings..."
1008="R&epair Image"
1009="&Restore Default"
1010="Note: Changing this file, effects all other files of this association."
1011="You must register IconPackager (only $14.95 standalone or $49.95 with Object Desktop) to use this feature. Please order at www.stardock.com."
1012="&Benefits of Registration"
1013="Tool tip:"
1014="Note: Changing the appearance for this folder will mean it is not visible from Command Prompt."
1015="View &History..."
1016="Run &IconPackager..."
1017="Run Icon&Explorer..."
1018="Edit using Icon&Developer..."
1019="&Rebuild Icon Cache"
1020="&About IconPackager"
1021=""
1022=""
1023=""
1024=""

;
;Explorer Shell Extension (Context Menu)
;
1030="Change Icon"
1031="Customize the icon for this folder, drive, or file type."

;
;IconPackager Explorer
;
2000="IconPackager Explorer"
2001="IconPackager Explorer is no longer associated with icon library files on your computer.\n\nWould you like to restore the file associations back to IconPackager Explorer?"
2002="View Files "
2003="Format "
2004="All Files"
2005="Icon Files"
2006="Icon Resources (*.ico)"
2007="Icon Libraries (*.icl)"
2008="Program Files (*.exe, *.cpl, *.ocx, *.dll)"
2009="Cursor Files (*.cur, *.ani)"
2010="Name"
2011="Type"
2012="Icons"
2013="New Library"
2014="Open Library"
2015="Save Library"
2016="Cut"
2017="Copy"
2018="Paste"
2019="Delete"
2020="Properties"
2021="Browser"
2022="View"
2023="Contents and Index"
2024="%d formats"
2025="%d icons"
2026="%d images"
2027="%d selected"
2028="You must select an image to continue."
2029="You must select one icon only."
2030="Open Library"
2031="Icon Files (*.ico; *.exe; *.dll; *.icl; *.ocx; *.cpl)|*.ico;*.exe;*.dll;*.icl;*.ocx;*.cpl|Programs (*.exe)|*.exe|Libraries (*.dll; *.ocx; *.icl; *.cpl)|*.dll;*.ocx;*.icl;*.cpl|Icons (*.ico)|*.ico|All Files (*.*)|*.*||" 
2032="Save As"
2033="Icon (*.ico)|*.ico|Cursor (*.cur)|*.cur|Bitmap (*.bmp)|*.bmp||"
2034="Save Library"
2035="Icon Library (*.icl)|*.icl|All Files|*.*||"
2036="Would you like to save your changes before continuing?"
2037="No icons found in file '%s'."
2038="All formats"
2039="Add Icon(s)"
2040="Icon Files (*.ico; *.exe; *.dll; *.icl; *.ocx; *.cpl)|*.ico;*.exe;*.dll;*.icl;*.ocx;*.cpl|Programs (*.exe)|*.exe|Libraries (*.dll; *.ocx; *.icl; *.cpl)|*.dll;*.ocx;*.icl;*.cpl|Icons (*.ico)|*.ico|All Files (*.*)|*.*||"
2041="No icons found in file '%s'."
2042="You must select an icon to rename."
2043="Are you sure you want to delete the %s icon format?"
2044="Copy of %s"
2045="Would you like to save your changes before closing?"
2046=" (Unregistered Copy)"
2047="Do not show this notice again"
2048=""
2049=""
2050=""

;
;IconPackager Explorer Settings
;
2100="Settings"
2101="OK"
2102="Cancel"
2103="General"
2104="Save IconPackager Explorer settings between sessions"
2105="Open icon library files with IconPackager Explorer"
2106="Ignore resource names"
2107=""
2108=""
2109=""

;
;IconPackager Explorer Rename Icons
;
2120="Rename Icons"
2121="Icon names:"
2122="OK"
2123="Cancel"
2124="You must enter a valid icon name to continue."
2125=""
2126=""
2127=""
2128=""
2129=""

;
;IconPackager Explorer Properties
;
2130="Icon Properties"
2131="Icon Formats"
2132="OK"
2133="Image dimensions: %d x %d pixels\n\nColor depth: %d bit\n\nImage size: %s bytes"
2134="Total image(s) size: %s bytes"
2135=""
2136=""
2137=""
2138=""
2139=""

;
;IconPackager Explorer Menu
;
2140="&File"
2141="&Edit"
2142="&View"
2143="&Tools"
2144="&Help"
2145=""
2146="&New\tCtrl+N"
2147="&Open...\tCtrl+O"
2148="&Save\tCtrl+S"
2149="Save &As..."
2150="E&xport As...\tCtrl+E"
2151="New &Window\tAlt+N"
2152="&Exit\tAlt+F4"
2153="&Edit Icon"
2154="A&dd Icon...\tCtrl+D"
2155="Cu&t\tCtrl+X"
2156="&Copy\tCtrl+C"
2157="&Paste\tCtrl+V"
2158="C&reate Copy"
2159="&Delete\tDel"
2160="Delete &Format"
2161="&Rename\tF2"
2162="Select All\tCtrl+A"
2163="In&vert Selection"
2164="&Properties...\tAlt+Enter"
2165="&Toolbar"
2166="Status &Bar"
2167="Bro&wser"
2168="&Large Icons"
2169="S&mall Icons"
2170="&List"
2171="&Details"
2172="&Refresh\tF5"
2173="Run Icon&Packager..."
2174="Run Icon&Developer..."
2175="Run &TweakShell..."
2176="&Rebuild Icon Cache"
2177="&Options..."
2178="&Contents and Index\tF1"
2179="&History"
2180="On The &Web"
2181="IconPackager &Web Site"
2182="IconPackager &Email"
2183="IconPackager &Forum"
2184="&Download Additional Packages"
2185="&About IconPackager Explorer"
2186="No Recent Files"
2187=""
2188=""
2189=""

;
;IconPackager Explorer Image Menu
;
2200="&Edit Icon"
2201="Edit using &IconDeveloper"
2202="&Add Icon\tCtrl+D"
2203="E&xport As...\tCtrl+E"
2204="Cu&t\tCtrl+X"
2205="&Copy\tCtrl+C"
2206="C&reate Copy"
2207="&Delete\tDel"
2208="&Rename\tF2"
2209="&Properties...\tAlt+Enter"
2210=""
2211=""
2212=""
2213=""
2214=""

;
;Internet Settings
;
6000="Internet Settings"
6001="&Help"
6002="OK"
6003="Cancel"
6004="General"
6005="Proxy Server"
6006="You can enter a proxy server address and port below that will be used to download from your LAN."
6007="&Address:"
6008="&Port:"
6009="&Username:"
6010="Pa&ssword:"
6011="Internet Explorer proxy server settings will be used if no proxy settings are configured above."
6012="Download Settings"
6013="Resume partially downloaded files"
6014="Delete file on cancelling download"
6015="Use WindowBlinds progress animations (if installed)"
6016="Display full filename and path when downloading"
6017="Request timeout:"
6018="seconds"
6019="Stardock Central Only"
6020="Retry failed downloads:"
6021="times"
6022="Retry delay:"
6023="seconds"
6024=""
6025=""
6026=""
6027=""
6028=""
6029=""

